Revit 2027 API
DefaultDivideSettings.SetSurfaceLayout Method
 Sets the default Divided Surface layout for U or V gridlines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSurfaceLayout(
	UVGridlineType gridlines,
	SpacingRuleLayout layout
)
Public Sub SetSurfaceLayout (
	gridlines As UVGridlineType,
	layout As SpacingRuleLayout
)
public:
void SetSurfaceLayout(
	UVGridlineType gridlines,
	SpacingRuleLayout layout
)
member SetSurfaceLayout :
        gridlines : UVGridlineType *
        layout : SpacingRuleLayout -> unit
Parameters
gridlines UVGridlineType
 U-gridlines or V-gridlines.
layout SpacingRuleLayout
 A layout spacing rule.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace